content/posts/Some_Relativistic_and_Gravitational_Properties_of_the_Wolfram_Model_by_Jonathan_Gorard_in_2020.md
+++
title = "Some Relativistic and Gravitational Properties of the Wolfram Model by Jonathan Gorard in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:56-04:00
slug = "Some_Relativistic_and_Gravitational_Properties_of_the_Wolfram_Model_by_Jonathan_Gorard_in_2020"
draft = false
+++

## [digital physics]({{< relref "digital_physics" >}}), [theoretical physics]({{< relref "theoretical_physics" >}}), [physics]({{< relref "physics" >}}), [general relativity]({{< relref "general_relativity" >}}) {#digital-physics--digital-physics-dot-md--theoretical-physics--theoretical-physics-dot-md--physics--physics-dot-md--general-relativity--general-relativity-dot-md}


## 1. Introduction {#1-dot-introduction}


## 2. Space, Time and Causality in the Wolfram Model {#2-dot-space-time-and-causality-in-the-wolfram-model}


### 2.1 Basic Formalism and Causal Graphs {#2-dot-1-basic-formalism-and-causal-graphs}


### 2.2 Abstract rewriting, the Church-Rosser property and causal invariance {#2-dot-2-abstract-rewriting-the-church-rosser-property-and-causal-invariance}


### 2.3 Causal graph hypersurfaces and discrete Lorentz covariance {#2-dot-3-causal-graph-hypersurfaces-and-discrete-lorentz-covariance}


### 2.4 Discrete Lorentz transformations {#2-dot-4-discrete-lorentz-transformations}


## 3. Discrete Geometry, Curvature and Gravitation in the Wolfram Model {#3-dot-discrete-geometry-curvature-and-gravitation-in-the-wolfram-model}


### 3.1 A Discrete Ricci Scalar Curvature for (Directed) Hypergraphs {#3-dot-1-a-discrete-ricci-scalar-curvature-for--directed--hypergraphs}


### 3.2 Parallel Transport, Discrete Holonomy, and the Discrete Spacetime Ricci Tensor {#3-dot-2-parallel-transport-discrete-holonomy-and-the-discrete-spacetime-ricci-tensor}


### 3.3 The Discrete Einstein Field Equations {#3-dot-3-the-discrete-einstein-field-equations}


### 3.4 Topology, Variable Dimensionality and Implications for Cosmology {#3-dot-4-topology-variable-dimensionality-and-implications-for-cosmology}


## 4. Concluding remarks {#4-dot-concluding-remarks}
